# vsoSetClosureGap

## Description
Provide a Gap for Left, Right, Top, Bottom edge of Wall Closure

```pascal
PROCEDURE vsoSetClosureGap(
				leftGapValue   : REAL;
				rightGapValue  : REAL;
				topGapValue    : REAL;
				bottomGapValue : REAL);
```

```python

def vs.vsoSetClosureGap(leftGapValue, rightGapValue, topGapValue, bottomGapValue):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|leftGapValue|REAL||
|rightGapValue|REAL||
|topGapValue|REAL||
|bottomGapValue|REAL||

## Version
Availability: from Vectorworks 2023
## Category
* Object Events